ENT.Base = "base_anim"
ENT.Type = "anim"
ENT.PrintName = "Question Quest"
ENT.Author = "repix"

ENT.Model = Model( "models/hunter/plates/plate2x4.mdl" )

function ENT:SetupDataTables()
    self:NetworkVar( "Int", 0, "Question" )
    self:NetworkVar( "Int", 1, "Round" )
    self:NetworkVar( "Int", 2, "State" )
    self:NetworkVar( "Float", 0, "Timeleft" )
end

ENT.Questions = {
    [1] = {
        Category = "Аниме",
        Question = "В какой стране появился и получил своё развитие жанр аниме?",
        Answers = {
            [1] = { "Вьетнам" },
            [2] = { "Китай" },
            [3] = { "Япония", true }
        }
    },
    [2] = {
        Category = "Аниме",
        Question = "Что такое сёдзё?",
        Answers = {
            [1] = { "аниме для девушек", true },
            [2] = { "аниме со сценами битвы" },
            [3] = { "персонаж в самурайской одежде" }
        }
    },
    [3] = {
        Category = "Аниме",
        Question = "Что такое манга?",
        Answers = {
            [1] = { "девушка в аниме" },
            [2] = { "комиксы, по которым снимают аниме", true },
            [3] = { "национальный японский костюм" }
        }
    },
    [4] = {
        Category = "Аниме",
        Question = "Как называют фанатов аниме и манги?",
        Answers = {
            [1] = { "отаку", true },
            [2] = { "наруто" },
            [3] = { "бурито" }
        }
    },
    [5] = {
        Category = "Аниме",
        Question = "Назовите одного из известнейших японских режиссёров-аниматоров, создавших мультфильмы в жанре аниме.",
        Answers = {
            [1] = { "Тсутому Шимомура" },
            [2] = { "Харуки Мураками" },
            [3] = { "Хаяо Миядзаки", true }
        }
    },
    [6] = {
        Category = "Аниме",
        Question = "Что означает слово спокон?",
        Answers = {
            [1] = { "длинный плащ у персонажей аниме" },
            [2] = { "жанр аниме о спортивных достижениях", true },
            [3] = { "спокойной ночи на японском" }
        }
    },
    [7] = {
        Category = "Аниме",
        Question = "Назовите аниме-сериал, известный многим советским детям.",
        Answers = {
            [1] = { "Евангелион" },
            [2] = { "Сейлор Мун" },
            [3] = { "Приключения пчёлки Майи", true }
        }
    },
    [8] = {
        Category = "Аниме",
        Question = "Какое известное аниме было снято по мотивам видеоигры?",
        Answers = {
            [1] = { "Покемон", true },
            [2] = { "Сейлор Мун" },
            [3] = { "Евангелион" }
        }
    },
    [9] = {
        Category = "Аниме",
        Question = "Назовите самый длинный аниме-сериал за всю историю.",
        Answers = {
            [1] = { "Садзаэ-сан", true },
            [2] = { "Наруто" },
            [3] = { "Покемон" }
        }
    },
    [10] = {
        Category = "Аниме",
        Question = "Как звали протагониста первой части «Невероятных приключений ДжоДжо»?",
        Answers = {
            [1] = { "Джонатан Джостар", true },
            [2] = { "Джотаро Куджо" },
            [3] = { "Джорно Джованна" }
        }
    },
    [11] = {
        Category = "Аниме",
        Question = "Какая анимационная студия сделала «Ковбой Бибоп»?",
        Answers = {
            [1] = { "Sunrise", true },
            [2] = { "Studio Pierrot" },
            [3] = { "Madhouse" }
        }
    },
    [12] = {
        Category = "Аниме",
        Question = "В «Невероятных приключениях ДжоДжо», кто говорит Yare Yare Daze?",
        Answers = {
            [1] = { "Хигашката Джоске" },
            [2] = { "Джотаро Куджо", true },
            [3] = { "Джозеф Джостар" }
        }
    },
    [13] = {
        Category = "Аниме",
        Question = "Кто автор хоррор-манги Uzumaki?",
        Answers = {
            [1] = { "Суи Ишида" },
            [2] = { "Джунджи Ито", true },
            [3] = { "Хаяо Миядзаки" }
        }
    },
    [14] = {
        Category = "Аниме",
        Question = "В каком году вышла первая серия «Атаки Титанов»?",
        Answers = {
            [1] = { "2012" },
            [2] = { "2013", true },
            [3] = { "2015" }
        }
    },
    [15] = {
        Category = "Аниме",
        Question = "В каком году вышла первая серия «Нет игры - нет жизни»?",
        Answers = {
            [1] = { "2014" },
            [2] = { "2018" },
            [3] = { "2017", true }
        }
    },
    [16] = {
        Category = "Аниме",
        Question = "Как зовут главного героя Persona 5?",
        Answers = {
            [1] = { "Амамия Рен", true },
            [2] = { "Сакамото Рьюджи" },
            [3] = { "Акечи Горо" }
        }
    },
    [17] = {
        Category = "Аниме",
        Question = "Из скольки серий состоит «Школа мертвецов»?",
        Answers = {
            [1] = { "24" },
            [2] = { "5" },
            [3] = { "12", true }
        }
    },
    [18] = {
        Category = "Япония",
        Question = "Какой город является столицей Японии?",
        Answers = {
            [1] = { "Токио", true },
            [2] = { "Киото" },
            [3] = { "Осака" }
        }
    },
    [19] = {
        Category = "Япония",
        Question = "Что говорят современные японцы, отвечая на телефонный звонок?",
        Answers = {
            [1] = { "Moshi-moshi", true },
            [2] = { "Ohayou" },
            [3] = { "Arigatou" }
        }
    },
    [20] = {
        Category = "Япония",
        Question = "Какая гора является самой высокой точкой Японии?",
        Answers = {
            [1] = { "Фудзияма", true },
            [2] = { "Онтаке" },
            [3] = { "Хакусан" }
        }
    },
    [21] = {
        Category = "Аниме",
        Question = "Дневник...",
        Answers = {
            [1] = { "Будущего", true },
            [2] = { "Прошлого" },
            [3] = { "Настоящего" }
        }
    },
    [22] = {
        Category = "Аниме",
        Question = "«Лучше я поверю и пожалею, чем усомнюсь и пожалею.». Цитата из...",
        Answers = {
            [1] = { "Атака Титанов" },
            [2] = { "Достучаться до тебя" },
            [3] = { "Мастер Меча Онлайн", true }
        }
    },
    [23] = {
        Category = "Аниме",
        Question = "«Плевать я хотел на твои проблемы, иди жалуйся метеориту!». Цитата из...",
        Answers = {
            [1] = { "Гинтама" },
            [2] = { "Ванпанчмен", true },
            [3] = { "Большой куш" }
        }
    },
    [24] = {
        Category = "Аниме",
        Question = "«Если я сказал — не брал, значит — не отдам!». Цитата из...",
        Answers = {
            [1] = { "Блич", true },
            [2] = { "Наруто" },
            [3] = { "Бакуман" }
        }
    },
    [25] = {
        Category = "Аниме",
        Question = "«Крутой день начинается с крутого утра.». Цитата из...",
        Answers = {
            [1] = { "Пожиратель душ", true },
            [2] = { "Нет игры - нет жизни" },
            [3] = { "Демоны старшей школы" }
        }
    },
    [26] = {
        Category = "Игры",
        Question = "В каком году вышла «Danganronpa: Trigger Happy Havoc»?",
        Answers = {
            [1] = { "2010", true },
            [2] = { "2012" },
            [3] = { "2014" }
        }
    },
    [27] = {
        Category = "Игры",
        Question = "Как звали очаровательного медведя в серии игр, аниме и манги «Danganronpa»?",
        Answers = {
            [1] = { "Стереокума" },
            [2] = { "Моночин" },
            [3] = { "Монокума", true }
        }
    },
    [28] = {
        Category = "Игры",
        Question = "В каком городе прошел CS:GO Dreamhack Open 2015?",
        Answers = {
            [1] = { "Йёнчёпинг (Швеция)" },
            [2] = { "Кёльн (Германия)" },
            [3] = { "Клуж (Румыния)", true }
        }
    },
    [29] = {
        Category = "Игры",
        Question = "Кем был создан тетрис?",
        Answers = {
            [1] = { "Стив Балмер" },
            [2] = { "Алексей Леонидович Пажитнов", true },
            [3] = { "Хиронобу Сакагути" }
        }
    },
}
